<a href="https://colab.research.google.com/github/MashaKubyshina/Learning-Code-1/blob/master/Cheat_Sheet_Data_Cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

# Types of dataframes

In [ ]:
# we can create dataframes using using a dictionary with a list of items
# we can also create a dataframe using series

In [ ]:
# the most common is from a dict of equal-length lists or Numpy arrays.

data = {'students': ['Alice','Bob','Charlie','Dave','Eva', 'Frank'],
      'subjects': ['Bio','Physics','Math','Arts','Chemistry', 'Economics'],
      'score1': [55, 40, 63, 90, 45, 45]}

df = pd.DataFrame(data)
df

  students   subjects  score1
0    Alice        Bio      55
1      Bob    Physics      40
2  Charlie       Math      63
3     Dave       Arts      90
4      Eva  Chemistry      45
5    Frank  Economics      45

In [ ]:
# subsetting a column

df.subjects

0          Bio
1      Physics
2         Math
3         Arts
4    Chemistry
5    Economics
Name: subjects, dtype: object

In [ ]:
df.columns

Index(['students', 'subjects', 'score1'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [ ]:
# broadcasting
# we added 5 to each value in the score1 column
df.score1 += 5
df

  students   subjects  score1
0    Alice        Bio      60
1      Bob    Physics      45
2  Charlie       Math      68
3     Dave       Arts      95
4      Eva  Chemistry      50
5    Frank  Economics      50

# iloc and loc

In [ ]:
# We can extract one row using iloc and loc just like in Series.

df.iloc[0]

students    Alice
subjects      Bio
score1         60
Name: 0, dtype: object

In [ ]:
df.iloc[0].index

Index(['students', 'subjects', 'score1'], dtype='object')

In [ ]:
# dataframe as a list of series

s0 = pd.Series({'students': 'Alice', 'Subjects' : 'Bio', 'score1' : 60})
s1 = pd.Series({'students': 'Bob', 'Subjects' : 'Physics', 'score1' : 45})
s2 = pd.Series({'students': 'Charlie', 'Subjects' : 'Math', 'score1' : 68})
s3 = pd.Series({'students': 'Dave', 'Subjects' : 'Arts', 'score1' : 95})
s4 = pd.Series({'students': 'Eva', 'Subjects' : 'Chemistry', 'score1' : 50})
s5 = pd.Series({'students': 'Frank', 'Subjects' : 'Economics', 'score1' : 50})

df2 = pd.DataFrame([s0, s1, s2, s3, s4, s5])
df2

In [ ]:
type(df.iloc[0])

pandas.core.series.Series

# Basic dataframe functions

In [ ]:
df.head()

  students   subjects  score1
0    Alice        Bio      60
1      Bob    Physics      45
2  Charlie       Math      68
3     Dave       Arts      95
4      Eva  Chemistry      50

In [ ]:
df.tail()

  students   subjects  score1
1      Bob    Physics      45
2  Charlie       Math      68
3     Dave       Arts      95
4      Eva  Chemistry      50
5    Frank  Economics      50

In [ ]:
# subsetting

df[1:3]

  students subjects  score1
1      Bob  Physics      45
2  Charlie     Math      68

In [ ]:
# more subsetting

df[1:3]['subjects']

1    Physics
2       Math
Name: subjects, dtype: object

# Categorical

In [ ]:
# CATEGORY
# We can create a category, different from regular array
# category is a set number of values that can be in the df

s = pd.Series(["a", "c", "b"], dtype="category") # 3 categories
s

0    a
1    c
2    b
dtype: category
Categories (3, object): ['a', 'b', 'c']

# Replace values in dataframes

In [ ]:
# let's use simple dataframe

df = pd.DataFrame({'a': [1, 2, 3, 4],
                   'b': np.arange(5,9),
                   'c': np.arange(100, 104)})
df

   a  b    c
0  1  5  100
1  2  6  101
2  3  7  102
3  4  8  103

In [ ]:
# sum rows

df.sum()

a     10
b     26
c    406
dtype: int64

In [ ]:
# sum columns

df.sum(axis=1)

0    106
1    109
2    112
3    115
dtype: int64

In [ ]:
# the same can be done with non numerical values (using string)
data = {'students': ['Alice','Bob','Charlie','Dave','Eva', 'Frank'],
      'subjects': ['Bio','Physics','Math','Arts','Chemistry', 'Economics'],
      'score1': [55, 40, 63, 90, 45, 45]}

df_4 = pd.DataFrame(data)
df_4

  students   subjects  score1
0    Alice        Bio      55
1      Bob    Physics      40
2  Charlie       Math      63
3     Dave       Arts      90
4      Eva  Chemistry      45
5    Frank  Economics      45

In [ ]:
# let's add another column
df_4["score2"] = [45, 55, 40, 90, 20, 25]

df_4

  students   subjects  score1  score2
0    Alice        Bio      55      45
1      Bob    Physics      40      55
2  Charlie       Math      63      40
3     Dave       Arts      90      90
4      Eva  Chemistry      45      20
5    Frank  Economics      45      25

In [ ]:
# and replace 45 for 25
df_4.replace(45, 25)
df_4

  students   subjects  score1  score2
0    Alice        Bio      55      45
1      Bob    Physics      40      55
2  Charlie       Math      63      40
3     Dave       Arts      90      90
4      Eva  Chemistry      45      20
5    Frank  Economics      45      25

In [ ]:
# replace only in 1 column

df_4.score1.replace(90, 30)

0    55
1    40
2    63
3    30
4    45
5    45
Name: score1, dtype: int64

df.replace("old value", "new value", inplace=True)

In [ ]:
# this works for one column or the whole dataset.
df_4.score1.replace(90, 30, inplace = True)
df_4

  students   subjects  score1  score2
0    Alice        Bio      55      45
1      Bob    Physics      40      55
2  Charlie       Math      63      40
3     Dave       Arts      30      90
4      Eva  Chemistry      45      20
5    Frank  Economics      45      25

# Missing Values in dataframes

In [ ]:
scores = pd.DataFrame({"Alice": [10000, 20000, 30000, np.nan],
                       "Bob": [15000, None, 25000, 30000],
                       "Charlie": [5000, 6000, None, 8200],
                       "Dave": [-1, 2000, None, None],
                       "Eva": [1, 4, None, 16]}
                      )
scores['rounds'] = pd.Series([2010, 2011, 2012, 2013])
scores.set_index('rounds', inplace=True)
scores

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0    -1.0   1.0
2011    20000.0      NaN   6000.0  2000.0   4.0
2012    30000.0  25000.0      NaN     NaN   NaN
2013        NaN  30000.0   8200.0     NaN  16.0

In [ ]:
# drop any row that has missing entries
scores.dropna()

          Alice      Bob  Charlie  Dave  Eva
rounds
2010    10000.0  15000.0   5000.0  -1.0  1.0

In [ ]:
# drop a column with missing data
scores.Dave.dropna()

rounds
2010      -1.0
2011    2000.0
Name: Dave, dtype: float64

In [ ]:
# replace negative with 0

scores.replace(-1, 0, inplace=True)
scores

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0     0.0   1.0
2011    20000.0      NaN   6000.0  2000.0   4.0
2012    30000.0  25000.0      NaN     NaN   NaN
2013        NaN  30000.0   8200.0     NaN  16.0

In [ ]:
# fill missing values with 100

scores.fillna(100) # inplace = False

          Alice      Bob  Charlie    Dave    Eva
rounds
2010    10000.0  15000.0   5000.0     0.0    1.0
2011    20000.0    100.0   6000.0  2000.0    4.0
2012    30000.0  25000.0    100.0   100.0  100.0
2013      100.0  30000.0   8200.0   100.0   16.0

# Filling missing values

In [ ]:
scores

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0     0.0   1.0
2011    20000.0      NaN   6000.0  2000.0   4.0
2012    30000.0  25000.0      NaN     NaN   NaN
2013        NaN  30000.0   8200.0     NaN  16.0

In [ ]:
# backfill

scores.fillna(method="bfill")

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0     0.0   1.0
2011    20000.0  25000.0   6000.0  2000.0   4.0
2012    30000.0  25000.0   8200.0     NaN  16.0
2013        NaN  30000.0   8200.0     NaN  16.0

In [ ]:
# forward fill

scores.fillna(method="ffill")

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0     0.0   1.0
2011    20000.0  15000.0   6000.0  2000.0   4.0
2012    30000.0  25000.0   6000.0  2000.0   4.0
2013    30000.0  30000.0   8200.0  2000.0  16.0

In [ ]:
# pad

scores.fillna(method="pad")

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0     0.0   1.0
2011    20000.0  15000.0   6000.0  2000.0   4.0
2012    30000.0  25000.0   6000.0  2000.0   4.0
2013    30000.0  30000.0   8200.0  2000.0  16.0

In [ ]:
#backfill

scores.fillna(method="backfill")

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0     0.0   1.0
2011    20000.0  25000.0   6000.0  2000.0   4.0
2012    30000.0  25000.0   8200.0     NaN  16.0
2013        NaN  30000.0   8200.0     NaN  16.0

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.interpolate.html#pandas.DataFrame.interpolate

# Interpolate missing values

In [ ]:
# If values are either increasing or decreasing in a pattern, we can interpolate the values for the missing entries, say as an average of the nearby values.

scores.interpolate(method="linear") # inplace=False

          Alice      Bob  Charlie    Dave   Eva
rounds
2010    10000.0  15000.0   5000.0     0.0   1.0
2011    20000.0  20000.0   6000.0  2000.0   4.0
2012    30000.0  25000.0   7100.0  2000.0  10.0
2013    30000.0  30000.0   8200.0  2000.0  16.0

In [ ]:
# interpolate using quadratic methord

scores["Eva"].interpolate(method="quadratic")

rounds
2010     1.0
2011     4.0
2012     9.0
2013    16.0
Name: Eva, dtype: float64

In [ ]:
# forward fill column 1

scores.fillna(method="ffill", axis = 1)

          Alice      Bob  Charlie     Dave      Eva
rounds
2010    10000.0  15000.0   5000.0      0.0      1.0
2011    20000.0  20000.0   6000.0   2000.0      4.0
2012    30000.0  25000.0  25000.0  25000.0  25000.0
2013        NaN  30000.0   8200.0   8200.0     16.0

# Groupby

In [ ]:
# GROUPBY
# We can group things by attributes
# first we create a dataframe

df = pd.DataFrame({'name' : ['Alice', 'Bob', 'Charlie', 'Daniele', 'Eva', 'Frank', 'Gus', 'Harriet', 'Ivan'],
                   'gender' : ['F', 'M', 'M', 'F', 'F', 'M', 'M', 'F', 'M'],
                   'year' : ['junior', 'senior', 'junior', 'senior', 'junior', 'senior', 'junior', 'senior', 'junior'],
                   'data1' : np.random.randint(0, 10,9),
                   'data2' : np.random.randint(11, 19, 9)})
df

      name gender    year  data1  data2
0    Alice      F  junior      4     16
1      Bob      M  senior      6     18
2  Charlie      M  junior      2     11
3  Daniele      F  senior      0     11
4      Eva      F  junior      7     17
5    Frank      M  senior      4     16
6      Gus      M  junior      6     11
7  Harriet      F  senior      4     12
8     Ivan      M  junior      0     12

In [ ]:
# we find mean 
# df[df['gender'] == 'M'].mean()
# df[df['gender'] == 'F'].mean()

# however we can also use GROUPBY

df.groupby(['gender']).mean()

        data1  data2
gender
F        3.75   14.0
M        3.60   13.6

In [ ]:
# We can count how manu values are in each subgroup
# here we have 4 F and 5 M values
# we select 'name' as a count column, or else it will print all the columns

df.groupby(['gender'])['name'].count()

gender
F    4
M    5
Name: name, dtype: int64

In [ ]:
# we can create a hierarchical clustering

df.groupby(['gender', 'year']).mean()

                  data1      data2
gender year
F      junior  5.500000  16.500000
       senior  2.000000  11.500000
M      junior  2.666667  11.333333
       senior  5.000000  17.000000

In [ ]:
# subsetting

df.groupby(['gender', 'year'])['data1'].mean()

gender  year
F       junior    5.500000
        senior    2.000000
M       junior    2.666667
        senior    5.000000
Name: data1, dtype: float64

In [ ]:
# we can also subset differently
grouped = df['data2'].groupby(df['gender'])
grouped.mean()

gender
F    14.0
M    13.6
Name: data2, dtype: float64

In [ ]:
# aggregate

df.groupby(['gender'])['data1'].aggregate(["mean", "min"])

        mean  min
gender
F       3.75    0
M       3.60    0

In [ ]:
# find the groups that we grouped
grouped.groups

{'F': [0, 3, 4, 7], 'M': [1, 2, 5, 6, 8]}

In [ ]:
# we can iterate over the groups and use the index position to get more data from the dataframe

for key, value in grouped.groups.items():
  print("key:", key)
  print("values", df.iloc[value])

key: F
values       name gender    year  data1  data2
0    Alice      F  junior      4     16
3  Daniele      F  senior      0     11
4      Eva      F  junior      7     17
7  Harriet      F  senior      4     12
key: M
values       name gender    year  data1  data2
1      Bob      M  senior      6     18
2  Charlie      M  junior      2     11
5    Frank      M  senior      4     16
6      Gus      M  junior      6     11
8     Ivan      M  junior      0     12

In [ ]:
# More aggregate functions using the aggregate method.

# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html

# Berkeley Dataset workbook

In [ ]:
url = 'https://data.cityofberkeley.info/api/views/k2nh-s5h5/rows.csv'

df = pd.read_csv(url)

df.head(4)

     CASENO                   OFFENSE  ...      City State
0  20047075            VEHICLE STOLEN  ...  Berkeley    CA
1  20049646            IDENTITY THEFT  ...  Berkeley    CA
2  21090137  THEFT FELONY (OVER $950)  ...  Berkeley    CA
3  20045958  THEFT FELONY (OVER $950)  ...  Berkeley    CA

[4 rows x 11 columns]

In [ ]:
# check the dataset
df.describe()

             CASENO        CVDOW
count  2.541000e+03  2541.000000
mean   2.035684e+07     3.070838
std    4.455391e+05     2.015027
min    2.004014e+07     0.000000
25%    2.004922e+07     1.000000
50%    2.005792e+07     3.000000
75%    2.100170e+07     5.000000
max    2.109024e+07     6.000000

In [ ]:
# check length
len(df)

2541

In [ ]:
# check shape
df.shape

(2541, 12)

# Splitting Time and Date in a column

In [ ]:
# splitting time and date from EVENTDT column
# we create a subset

df_date=df["EVENTDT"].str.split()
df_date.head()

0    [10/11/2020, 12:00:00, AM]
1    [09/29/2020, 12:00:00, AM]
2    [01/28/2021, 12:00:00, AM]
3    [10/04/2020, 12:00:00, AM]
4    [11/02/2020, 12:00:00, AM]
Name: EVENTDT, dtype: object

In [ ]:
# we subset the date only (column 0)

df_date_only=df_date.str[0]
df_date_only.head()

0    10/11/2020
1    09/29/2020
2    01/28/2021
3    10/04/2020
4    11/02/2020
Name: EVENTDT, dtype: object

In [ ]:
# we create the column "df_date_only"

df['df_date_only']=df_date_only
df['df_date_only'].head()

0    10/11/2020
1    09/29/2020
2    01/28/2021
3    10/04/2020
4    11/02/2020
Name: df_date_only, dtype: object

In [ ]:
# check the head (scroll to the right to see the new column was added)

df.head(3)

     CASENO                   OFFENSE  ... State df_date_only
0  20047075            VEHICLE STOLEN  ...    CA   10/11/2020
1  20049646            IDENTITY THEFT  ...    CA   09/29/2020
2  21090137  THEFT FELONY (OVER $950)  ...    CA   01/28/2021

[3 rows x 12 columns]

# Creating Day of the Week by mapping

In [ ]:
# let's create the days of the week to work with CVDOW column

day_map={"0" : "Sunday", "1" : "Monday", "2" : "Tuesday", "3":"Wednesday", "4" : "Thursday", "5" : "Friday", "6" : "Saturday"}
day_map

{'0': 'Sunday',
 '1': 'Monday',
 '2': 'Tuesday',
 '3': 'Wednesday',
 '4': 'Thursday',
 '5': 'Friday',
 '6': 'Saturday'}

In [ ]:
# we add column "DAY" to the end of the dataset mapping the days of the week

df["DAY"] = df.CVDOW.map({ 0 : "Sunday", 1 : "Monday", 2 : "Tuesday", 3: "Wednesday",  4 : "Thursday", 5 : "Friday", 6 : "Saturday"}).astype("category")
df["DAY"]

0         Sunday
1        Tuesday
2       Thursday
3         Sunday
4         Monday
          ...
2536      Friday
2537      Monday
2538    Thursday
2539     Tuesday
2540      Sunday
Name: DAY, Length: 2541, dtype: category
Categories (7, object): ['Friday', 'Monday', 'Saturday', 'Sunday', 'Thursday', 'Tuesday',
                         'Wednesday']

# Exploring dataset with pd.Series

In [ ]:
# Let's examine the dataset using pd.series

# finding unique offenses

pd.Series.unique(df['OFFENSE'])

array(['VEHICLE STOLEN', 'IDENTITY THEFT', 'THEFT FELONY (OVER $950)',
       'ASSAULT/BATTERY MISD.', 'THEFT MISD. (UNDER $950)', 'DISTURBANCE',
       'MISSING ADULT', 'BURGLARY COMMERCIAL', 'VANDALISM',
       'BURGLARY AUTO', 'ROBBERY', 'THEFT FROM AUTO',
       'BURGLARY RESIDENTIAL', 'NARCOTICS', 'GUN/WEAPON',
       'DOMESTIC VIOLENCE', 'BRANDISHING', 'ARSON',
       'ASSAULT/BATTERY FEL.', 'SEXUAL ASSAULT FEL.', 'THEFT FROM PERSON',
       'ALCOHOL OFFENSE', 'FRAUD/FORGERY', 'VEHICLE RECOVERED',
       'SEXUAL ASSAULT MISD.', 'MUNICIPAL CODE', 'MISSING JUVENILE',
       'HOMICIDE'], dtype=object)

In [ ]:
# counting values of each offense

df['OFFENSE'].value_counts()

THEFT MISD. (UNDER $950)    574
THEFT FELONY (OVER $950)    237
VEHICLE STOLEN              212
DISTURBANCE                 182
BURGLARY RESIDENTIAL        180
BURGLARY AUTO               159
VANDALISM                   156
THEFT FROM AUTO             144
ASSAULT/BATTERY MISD.       105
BURGLARY COMMERCIAL          97
ROBBERY                      91
DOMESTIC VIOLENCE            87
IDENTITY THEFT               72
FRAUD/FORGERY                44
ASSAULT/BATTERY FEL.         32
MISSING ADULT                28
NARCOTICS                    28
ALCOHOL OFFENSE              22
ARSON                        20
BRANDISHING                  18
GUN/WEAPON                   14
SEXUAL ASSAULT FEL.          11
SEXUAL ASSAULT MISD.         10
THEFT FROM PERSON             8
VEHICLE RECOVERED             3
MISSING JUVENILE              3
HOMICIDE                      2
MUNICIPAL CODE                2
Name: OFFENSE, dtype: int64

In [ ]:
# finding unique CVlegend

pd.Series.unique(df['CVLEGEND'])

array(['MOTOR VEHICLE THEFT', 'FRAUD', 'LARCENY', 'ASSAULT',
       'DISORDERLY CONDUCT', 'MISSING PERSON', 'BURGLARY - COMMERCIAL',
       'VANDALISM', 'BURGLARY - VEHICLE', 'ROBBERY',
       'LARCENY - FROM VEHICLE', 'BURGLARY - RESIDENTIAL',
       'DRUG VIOLATION', 'WEAPONS OFFENSE', 'FAMILY OFFENSE', 'ARSON',
       'SEX CRIME', 'LIQUOR LAW VIOLATION', 'RECOVERED VEHICLE',
       'ALL OTHER OFFENSES', 'HOMICIDE'], dtype=object)

In [ ]:
# unique value counts for CVlegend
df['CVLEGEND'].value_counts()

LARCENY                   819
MOTOR VEHICLE THEFT       212
DISORDERLY CONDUCT        182
BURGLARY - RESIDENTIAL    180
BURGLARY - VEHICLE        159
VANDALISM                 156
LARCENY - FROM VEHICLE    144
ASSAULT                   137
FRAUD                     116
BURGLARY - COMMERCIAL      97
ROBBERY                    91
FAMILY OFFENSE             87
WEAPONS OFFENSE            32
MISSING PERSON             31
DRUG VIOLATION             28
LIQUOR LAW VIOLATION       22
SEX CRIME                  21
ARSON                      20
RECOVERED VEHICLE           3
ALL OTHER OFFENSES          2
HOMICIDE                    2
Name: CVLEGEND, dtype: int64

In [ ]:
# number of unique offenses in CVlegend

df['CVLEGEND'].nunique()

21

# Exploring Berkeley dataset with groupby

In [ ]:
# 1. How many events (of any kind) have occured on different days of the week?

df.groupby(['DAY'])['CASENO'].count()

DAY
Friday       388
Monday       366
Saturday     390
Sunday       344
Thursday     351
Tuesday      353
Wednesday    349
Name: CASENO, dtype: int64

In [ ]:
# 2. CVLEGEND has 21 kinds of crimes. How many events (CVLEGEND) of each kind have occured?

df.groupby(['CVLEGEND'])['CASENO'].count()

CVLEGEND
ALL OTHER OFFENSES          2
ARSON                      20
ASSAULT                   137
BURGLARY - COMMERCIAL      97
BURGLARY - RESIDENTIAL    180
BURGLARY - VEHICLE        159
DISORDERLY CONDUCT        182
DRUG VIOLATION             28
FAMILY OFFENSE             87
FRAUD                     116
HOMICIDE                    2
LARCENY                   819
LARCENY - FROM VEHICLE    144
LIQUOR LAW VIOLATION       22
MISSING PERSON             31
MOTOR VEHICLE THEFT       212
RECOVERED VEHICLE           3
ROBBERY                    91
SEX CRIME                  21
VANDALISM                 156
WEAPONS OFFENSE            32
Name: CASENO, dtype: int64

In [ ]:
df.groupby(['CVLEGEND'])['OFFENSE'].count()

CVLEGEND
ALL OTHER OFFENSES          2
ARSON                      20
ASSAULT                   137
BURGLARY - COMMERCIAL      97
BURGLARY - RESIDENTIAL    180
BURGLARY - VEHICLE        159
DISORDERLY CONDUCT        182
DRUG VIOLATION             28
FAMILY OFFENSE             87
FRAUD                     116
HOMICIDE                    2
LARCENY                   819
LARCENY - FROM VEHICLE    144
LIQUOR LAW VIOLATION       22
MISSING PERSON             31
MOTOR VEHICLE THEFT       212
RECOVERED VEHICLE           3
ROBBERY                    91
SEX CRIME                  21
VANDALISM                 156
WEAPONS OFFENSE            32
Name: OFFENSE, dtype: int64

In [ ]:
# Pick the crime type that is most common. How many events of this kind occur on different days of the week?

# subset the part of the df where cvlegend=larceny
# we need to do it in 2 steps

lar_df=df[df['CVLEGEND']=='LARCENY']
lar_df.groupby('DAY')['CASENO'].count()

DAY
Friday       109
Monday       131
Saturday     135
Sunday       110
Thursday     113
Tuesday      122
Wednesday     99
Name: CASENO, dtype: int64

In [ ]:
# alternative way to do it
# Pick the crime type that is most common. How many events of this kind occur on different days of the week?

df[df['CVLEGEND']=='LARCENY'].groupby('DAY')['CASENO'].count()

DAY
Friday       109
Monday       131
Saturday     135
Sunday       110
Thursday     113
Tuesday      122
Wednesday     99
Name: CASENO, dtype: int64

In [ ]:
df['DAY'].groupby(df['CVLEGEND'])

In [ ]:
# 4. How many events of any kind have happened on different days of the week? 
# (this can have upto 21x7 groups for 21 crime types and 7 days of the week.)
# there should be 21x7=147 entries (lines)

grouped = df.groupby('DAY')
grouped

In [ ]:
# not all the values are printed, but all 147 entries seem present

df.groupby(['DAY', 'CVLEGEND'])['CASENO'].count()

DAY        CVLEGEND
Friday     ALL OTHER OFFENSES         1
           ARSON                      6
           ASSAULT                   26
           BURGLARY - COMMERCIAL     16
           BURGLARY - RESIDENTIAL    34
                                     ..
Wednesday  RECOVERED VEHICLE          1
           ROBBERY                   17
           SEX CRIME                  3
           VANDALISM                 19
           WEAPONS OFFENSE            6
Name: CASENO, Length: 147, dtype: int64

In [ ]:
# Alternative way to do question #4

df.groupby(['DAY', 'CVLEGEND'])['CASENO'].groups

{('Friday', 'ALL OTHER OFFENSES'): [498], ('Friday', 'ARSON'): [116, 422, 631, 1271, 1921, 2520], ('Friday', 'ASSAULT'): [78, 165, 431, 523, 622, 728, 909, 984, 1148, 1325, 1339, 1414, 1510, 1763, 1950, 1975, 2013, 2063, 2154, 2165, 2176, 2180, 2317, 2338, 2404, 2456], ('Friday', 'BURGLARY - COMMERCIAL'): [42, 135, 245, 402, 549, 775, 791, 1177, 1849, 1978, 2046, 2211, 2216, 2392, 2397, 2416], ('Friday', 'BURGLARY - RESIDENTIAL'): [114, 152, 156, 222, 249, 281, 343, 346, 396, 452, 511, 513, 587, 656, 714, 733, 779, 1013, 1128, 1252, 1287, 1365, 1405, 1532, 1564, 1607, 1712, 1758, 1813, 2159, 2400, 2435, 2490, 2532], ('Friday', 'BURGLARY - VEHICLE'): [113, 137, 419, 485, 810, 850, 981, 1034, 1087, 1195, 1230, 1563, 1586, 1642, 1742, 1745, 1843, 1888, 1923, 1979, 2006, 2080, 2207, 2246], ('Friday', 'DISORDERLY CONDUCT'): [166, 336, 341, 375, 438, 456, 476, 596, 638, 786, 878, 950, 1041, 1088, 1192, 1227, 1353, 1372, 1425, 1584, 1618, 1705, 1821, 2008, 2286, 2325, 2517, 2534], ('Friday', 'DRUG VIOLATION'): [139, 512, 1255, 1258, 1269, 1562, 2043, 2485], ('Friday', 'FAMILY OFFENSE'): [192, 405, 835, 931, 934, 1183, 1373, 1449, 1716, 2473], ('Friday', 'FRAUD'): [14, 268, 418, 508, 571, 698, 876, 1023, 1035, 1063, 1072, 1194, 1519, 1770, 1935, 2071, 2115, 2141, 2242, 2367, 2385, 2399, 2401, 2507], ('Friday', 'LARCENY'): [5, 21, 31, 41, 90, 140, 159, 233, 236, 254, 303, 305, 333, 335, 357, 377, 382, 427, 441, 467, 510, 519, 528, 547, 559, 633, 639, 647, 658, 677, 769, 782, 797, 814, 816, 833, 843, 848, 871, 872, 907, 914, 942, 967, 994, 1000, 1025, 1054, 1099, 1116, 1145, 1158, 1168, 1204, 1206, 1209, 1276, 1336, 1346, 1348, 1355, 1379, 1382, 1391, 1403, 1489, 1513, 1528, 1537, 1543, 1593, 1620, 1624, 1645, 1665, 1718, 1723, 1757, 1782, 1818, 1852, 1864, 1914, 1927, 1939, 1999, 2015, 2038, 2085, 2136, 2139, 2155, 2179, 2231, 2247, 2248, 2265, 2278, 2299, 2307, ...], ('Friday', 'LARCENY - FROM VEHICLE'): [37, 378, 388, 736, 945, 1075, 1175, 1231, 1384, 1486, 1775, 1792, 1805, 1949, 2021, 2090, 2168, 2418, 2426, 2522], ('Friday', 'LIQUOR LAW VIOLATION'): [208, 1281, 1851, 2156], ('Friday', 'MISSING PERSON'): [532, 578, 887, 1332, 1640, 1976], ('Friday', 'MOTOR VEHICLE THEFT'): [149, 178, 278, 287, 443, 637, 688, 748, 809, 847, 858, 1026, 1077, 1137, 1377, 1455, 1572, 1629, 1664, 1765, 1829, 2055, 2069, 2086, 2230, 2336, 2389, 2410, 2412, 2450, 2469, 2487], ('Friday', 'ROBBERY'): [26, 36, 173, 577, 960, 1182, 1707, 1868, 2001, 2047, 2060, 2260], ('Friday', 'SEX CRIME'): [95, 398, 1291, 2321], ('Friday', 'VANDALISM'): [130, 170, 331, 376, 709, 787, 991, 1241, 1335, 1465, 1512, 1675, 1802, 1804, 1867, 1912, 2026, 2359, 2409, 2525], ('Friday', 'WEAPONS OFFENSE'): [676, 2132, 2289, 2535], ('Monday', 'ARSON'): [297, 650, 2328], ('Monday', 'ASSAULT'): [4, 19, 77, 220, 361, 387, 599, 683, 801, 913, 1229, 1265, 1303, 1374, 1539, 1571, 1636, 1729, 2097, 2147, 2178], ('Monday', 'BURGLARY - COMMERCIAL'): [35, 317, 454, 635, 989, 1330, 1409, 1855, 2206], ('Monday', 'BURGLARY - RESIDENTIAL'): [489, 492, 539, 624, 719, 723, 742, 763, 808, 903, 922, 996, 1001, 1030, 1095, 1167, 1174, 1387, 1407, 1737, 1756, 2023], ('Monday', 'BURGLARY - VEHICLE'): [104, 150, 315, 316, 414, 424, 1059, 1219, 1366, 1490, 1657, 1903, 1969, 2044, 2237, 2256, 2274, 2413], ('Monday', 'DISORDERLY CONDUCT'): [58, 253, 399, 403, 947, 1038, 1089, 1207, 1239, 1323, 1343, 1383, 1498, 1536, 1609, 1687, 1738, 1806, 1876, 2049, 2135, 2140, 2296, 2510, 2526, 2537], ('Monday', 'DRUG VIOLATION'): [1494], ('Monday', 'FAMILY OFFENSE'): [175, 461, 487, 641, 672, 836, 1002, 1037, 1149, 1385, 1660, 1911, 2106], ('Monday', 'FRAUD'): [127, 200, 428, 435, 478, 482, 518, 873, 1130, 1200, 1247, 1315, 1338, 1436, 1630, 1650, 1859, 2007, 2273, 2373, 2503], ('Monday', 'LARCENY'): [13, 18, 24, 38, 40, 62, 92, 99, 108, 111, 142, 157, 213, 235, 238, 251, 256, 257, 319, 329, 460, 473, 525, 557, 566, 605, 616, 630, 642, 653, 661, 685, 731, 739, 750, 755, 762, 795, 826, 837, 840, 842, 861, 862, 869, 870, 886, 890, 897, 921, 927, 986, 1003, 1006, 1014, 1016, 1047, 1058, 1069, 1100, 1113, 1134, 1150, 1220, 1232, 1254, 1274, 1322, 1324, 1351, 1371, 1408, 1418, 1430, 1441, 1454, 1501, 1540, 1549, 1561, 1567, 1568, 1603, 1619, 1654, 1667, 1691, 1722, 1728, 1739, 1787, 1800, 1834, 1850, 1854, 1858, 1877, 1905, 1907, 1913, ...], ('Monday', 'LARCENY - FROM VEHICLE'): [56, 89, 266, 437, 520, 803, 881, 1051, 1314, 1395, 1560, 1602, 1736, 1749, 1955, 1970, 1994, 2091, 2094, 2235, 2253, 2262, 2310, 2453, 2470, 2486, 2516], ('Monday', 'LIQUOR LAW VIOLATION'): [720, 857], ('Monday', 'MISSING PERSON'): [307, 522, 753, 761, 1278, 2313, 2345], ('Monday', 'MOTOR VEHICLE THEFT'): [7, 91, 323, 390, 732, 751, 776, 839, 880, 923, 1039, 1060, 1226, 1249, 1326, 1514, 2182, 2217, 2308, 2316, 2515], ('Monday', 'ROBBERY'): [309, 350, 380, 713, 743, 831, 1363, 1627, 1697, 2092, 2162, 2304, 2421], ('Monday', 'SEX CRIME'): [724, 2311], ('Monday', 'VANDALISM'): [45, 242, 290, 310, 494, 727, 759, 838, 943, 992, 1011, 1107, 1127, 1176, 1406, 1517, 1617, 1635, 1670, 1777, 1916, 2036, 2040, 2122, 2414, 2491, 2531], ('Monday', 'WEAPONS OFFENSE'): [79, 2131], ('Saturday', 'ARSON'): [84, 530, 540, 1101, 1531, 1648, 1835], ('Saturday', 'ASSAULT'): [59, 87, 177, 212, 231, 551, 594, 1188, 1286, 1288, 1317, 1421, 1459, 1579, 1832, 1879, 1944, 2303, 2306, 2488], ('Saturday', 'BURGLARY - COMMERCIAL'): [199, 216, 645, 766, 794, 812, 1044, 1309, 1506, 1844, 1960, 2123, 2266, 2444, 2484], ('Saturday', 'BURGLARY - RESIDENTIAL'): [74, 360, 445, 481, 493, 567, 629, 646, 663, 670, 716, 813, 856, 941, 983, 1084, 1102, 1447, 1524, 1892, 1954, 1964, 2205, 2224, 2350], ('Saturday', 'BURGLARY - VEHICLE'): [72, 204, 209, 215, 353, 394, 603, 741, 780, 824, 905, 957, 970, 993, 1040, 1173, 1197, 1350, 1895, 1963, 1980, 2024, 2291, 2428, 2481], ('Saturday', 'DISORDERLY CONDUCT'): [6, 83, 100, 337, 421, 515, 617, 859, 866, 901, 937, 990, 1019, 1184, 1246, 1446, 1496, 1499, 1774, 1824, 1828, 2153, 2215], ('Saturday', 'DRUG VIOLATION'): [607, 1704, 2035, 2320, 2339, 2374], ('Saturday', 'FAMILY OFFENSE'): [64, 190, 556, 655, 789, 1250, 1328, 1419, 1544, 1581, 2431, 2506], ('Saturday', 'FRAUD'): [465, 534, 926, 1244, 1741, 1761, 2169, 2172], ('Saturday', 'HOMICIDE'): [802], ('Saturday', 'LARCENY'): [10, 39, 49, 60, 63, 66, 69, 118, 154, 219, 227, 241, 243, 263, 289, 306, 322, 328, 342, 345, 363, 366, 367, 369, 395, 412, 436, 453, 455, 484, 500, 502, 542, 562, 589, 597, 654, 665, 674, 675, 687, 691, 729, 738, 756, 793, 818, 828, 863, 868, 879, 888, 912, 955, 965, 1064, 1090, 1126, 1138, 1161, 1162, 1191, 1214, 1225, 1267, 1299, 1311, 1333, 1347, 1392, 1396, 1413, 1453, 1460, 1468, 1473, 1476, 1487, 1502, 1516, 1525, 1547, 1578, 1591, 1604, 1634, 1639, 1662, 1696, 1699, 1762, 1768, 1779, 1799, 1890, 1936, 1953, 1966, 1981, 1984, ...], ('Saturday', 'LARCENY - FROM VEHICLE'): [129, 406, 439, 458, 573, 620, 696, 1223, 1262, 1589, 1767, 1885, 1951, 2031, 2161, 2268, 2355, 2379, 2466, 2498], ('Saturday', 'LIQUOR LAW VIOLATION'): [160, 819, 1370, 1814, 1928, 1946, 2082, 2368], ('Saturday', 'MISSING PERSON'): [174, 1376, 1759], ('Saturday', 'MOTOR VEHICLE THEFT'): [22, 25, 51, 132, 180, 283, 296, 304, 545, 565, 576, 598, 682, 800, 849, 882, 961, 1112, 1248, 1313, 1551, 1632, 1681, 1875, 1883, 1934, 1945, 2101, 2158, 2243, 2259, 2468, 2521], ('Saturday', 'RECOVERED VEHICLE'): [1133], ('Saturday', 'ROBBERY'): [47, 364, 423, 558, 695, 860, 933, 1076, 1481, 1527, 1894, 1996, 2066, 2294, 2301], ('Saturday', 'SEX CRIME'): [1393, 2257, 2269], ('Saturday', 'VANDALISM'): [274, 292, 334, 615, 722, 821, 939, 1028, 1321, 1399, 1438, 1535, 1647, 1720, 1910, 1948, 1988, 2014, 2017, 2225, 2264, 2309, 2331, 2381, 2454], ('Saturday', 'WEAPONS OFFENSE'): [651, 959, 1511, 1784, 2384], ('Sunday', 'ALL OTHER OFFENSES'): [1083], ('Sunday', 'ASSAULT'): [34, 151, 371, 974, 1086, 1381, 1491, 1533, 1860, 2149, 2190, 2223, 2229, 2287, 2425, 2513], ('Sunday', 'BURGLARY - COMMERCIAL'): [202, 417, 507, 509, 726, 1268, 1410, 1445, 1615, 1698, 1893, 1901, 2012, 2218, 2326, 2380, 2405, 2540], ('Sunday', 'BURGLARY - RESIDENTIAL'): [61, 144, 183, 224, 298, 841, 946, 1117, 1266, 1397, 1523, 1693, 1694, 1703, 1725, 1727, 1786, 2019], ('Sunday', 'BURGLARY - VEHICLE'): [23, 81, 124, 265, 397, 410, 475, 524, 894, 1056, 1135, 1213, 1386, 1504, 1637, 1673, 1785, 2183, 2255, 2344], ('Sunday', 'DISORDERLY CONDUCT'): [110, 167, 308, 327, 479, 497, 593, 618, 822, 834, 845, 920, 1045, 1122, 1160, 1163, 1211, 1217, 1389, 1483, 1585, 1592, 1679, 1733, 1997, 2004, 2102, 2118, 2177, 2193], ('Sunday', 'DRUG VIOLATION'): [1020, 1221, 2462], ('Sunday', 'FAMILY OFFENSE'): [230, 471, 543, 614, 692, 877, 940, 1070, 1140, 1264, 1457, 1597, 1869, 2079, 2081, 2088, 2130, 2312, 2323, 2333, 2348, 2354], ('Sunday', 'FRAUD'): [246, 300, 501, 1065, 1580, 1643, 1781, 2251, 2371], ('Sunday', 'LARCENY'): [3, 8, 12, 48, 70, 86, 94, 97, 103, 115, 141, 153, 161, 168, 179, 186, 201, 211, 237, 252, 262, 273, 354, 358, 408, 434, 444, 474, 488, 503, 526, 586, 604, 608, 678, 764, 904, 918, 958, 1018, 1036, 1053, 1091, 1104, 1108, 1109, 1120, 1131, 1154, 1179, 1243, 1290, 1296, 1331, 1349, 1390, 1416, 1424, 1428, 1443, 1451, 1485, 1569, 1575, 1601, 1628, 1656, 1671, 1680, 1689, 1711, 1713, 1721, 1734, 1735, 1740, 1752, 1788, 1795, 1809, 1841, 1870, 1872, 1899, 1900, 1918, 1920, 1922, 1952, 1977, 2010, 2173, 2187, 2192, 2199, 2209, 2239, 2252, 2263, 2363, ...], ('Sunday', 'LARCENY - FROM VEHICLE'): [53, 531, 643, 690, 935, 1042, 1164, 1218, 1224, 1590, 1956, 2127, 2297, 2342], ('Sunday', 'LIQUOR LAW VIOLATION'): [1199, 1600], ('Sunday', 'MISSING PERSON'): [29, 649, 852, 1307], ('Sunday', 'MOTOR VEHICLE THEFT'): [0, 205, 270, 514, 602, 606, 613, 660, 671, 706, 734, 948, 988, 997, 1153, 1215, 1233, 1417, 1452, 1548, 1783, 1857, 1940, 1962, 2022, 2048, 2068, 2093, 2250, 2352, 2358, 2463], ('Sunday', 'ROBBERY'): [33, 128, 338, 389, 404, 963, 979, 1415, 1437, 1708, 1731, 1957], ('Sunday', 'SEX CRIME'): [112, 269, 580, 1318, 2386], ('Sunday', 'VANDALISM'): [184, 321, 324, 432, 564, 575, 591, 636, 760, 867, 954, 1190, 1292, 1565, 1669, 1692, 1773, 1886, 1904, 1932, 1990, 2171, 2213, 2227], ('Sunday', 'WEAPONS OFFENSE'): [1469, 1706, 2157, 2391], ('Thursday', 'ASSAULT'): [181, 448, 490, 541, 555, 611, 1280, 1308, 1341, 1362, 1534, 1796, 1823, 1972, 2057, 2133, 2438], ('Thursday', 'BURGLARY - COMMERCIAL'): [272, 355, 619, 679, 792, 910, 1764, 1771, 1982, 2053, 2283, 2411], ('Thursday', 'BURGLARY - RESIDENTIAL'): [44, 73, 264, 320, 400, 401, 758, 823, 885, 908, 1124, 1142, 1234, 1279, 1361, 1388, 1423, 1432, 1480, 1674, 1719, 1871, 2027, 2041, 2330, 2337, 2476, 2524], ('Thursday', 'BURGLARY - VEHICLE'): [232, 285, 291, 326, 446, 572, 628, 632, 712, 805, 811, 884, 1024, 1106, 1461, 1478, 1605, 1646, 1695, 1794, 1845, 1891, 1958, 2037, 2045, 2089, 2417, 2528, 2529], ('Thursday', 'DISORDERLY CONDUCT'): [67, 196, 457, 504, 569, 600, 610, 686, 754, 825, 938, 971, 1022, 1302, 1398, 1508, 1526, 1558, 1559, 1780, 1917, 2061, 2100, 2332, 2353, 2493], ('Thursday', 'DRUG VIOLATION'): [259, 1588, 1915], ('Thursday', 'FAMILY OFFENSE'): [626, 693, 1240, 1553, 1941, 2025, 2300, 2527], ('Thursday', 'FRAUD'): [162, 214, 293, 294, 744, 924, 966, 1008, 1049, 1079, 1151, 1172, 1431, 1440, 1598, 1652, 1769, 1820, 2105, 2254, 2394, 2499], ('Thursday', 'LARCENY'): [2, 57, 68, 75, 101, 120, 126, 131, 239, 359, 365, 370, 411, 429, 442, 470, 527, 535, 552, 554, 560, 601, 612, 681, 700, 710, 745, 770, 772, 783, 830, 875, 896, 898, 919, 952, 977, 1021, 1055, 1068, 1073, 1081, 1096, 1115, 1119, 1132, 1141, 1152, 1187, 1208, 1212, 1257, 1316, 1368, 1401, 1402, 1404, 1444, 1466, 1475, 1493, 1515, 1522, 1529, 1541, 1574, 1583, 1623, 1633, 1651, 1676, 1677, 1683, 1702, 1730, 1746, 1747, 1750, 1751, 1798, 1815, 1827, 1833, 1837, 1840, 1853, 1856, 1865, 1874, 1887, 1933, 1967, 2002, 2074, 2112, 2114, 2125, 2137, 2184, 2198, ...], ('Thursday', 'LARCENY - FROM VEHICLE'): [93, 210, 379, 413, 627, 680, 864, 1062, 1155, 1216, 1456, 1470, 1760, 1831, 1884, 1929, 2210, 2347, 2372, 2459, 2478, 2504], ('Thursday', 'LIQUOR LAW VIOLATION'): [2185], ('Thursday', 'MISSING PERSON'): [1557, 2067, 2073], ('Thursday', 'MOTOR VEHICLE THEFT'): [107, 119, 449, 546, 550, 673, 749, 796, 949, 956, 998, 1017, 1129, 1210, 1251, 1344, 1474, 1542, 1587, 1655, 1666, 1797, 1862, 2050, 2194, 2398, 2511], ('Thursday', 'RECOVERED VEHICLE'): [221], ('Thursday', 'ROBBERY'): [80, 483, 1169, 1170, 1185, 1357, 1776, 2148], ('Thursday', 'SEX CRIME'): [579, 788, 2396], ('Thursday', 'VANDALISM'): [228, 247, 255, 662, 708, 740, 746, 883, 1057, 1285, 1375, 1566, 1625, 1659, 1715, 1937, 2018, 2095, 2099, 2244, 2275], ('Thursday', 'WEAPONS OFFENSE'): [50, 798, 804, 1690, 1812, 1906, 2078], ('Tuesday', 'ASSAULT'): [145, 187, 240, 666, 711, 735, 953, 976, 1005, 1027, 1139, 1270, 1319, 1789, 1807, 2000, 2219, 2387], ('Tuesday', 'BURGLARY - COMMERCIAL'): [88, 206, 505, 506, 568, 657, 664, 829, 1012, 1015, 1284, 2033, 2175, 2220, 2302], ('Tuesday', 'BURGLARY - RESIDENTIAL'): [134, 312, 517, 548, 684, 697, 820, 865, 874, 889, 982, 1144, 1352, 1484, 1530, 1596, 1748, 1816, 1889, 1931, 2029, 2343, 2442, 2448], ('Tuesday', 'BURGLARY - VEHICLE'): [82, 136, 194, 302, 325, 374, 420, 433, 570, 667, 668, 768, 815, 928, 999, 1067, 1228, 1289, 1358, 1471, 2267, 2282, 2480], ('Tuesday', 'DISORDERLY CONDUCT'): [98, 133, 176, 203, 244, 462, 486, 516, 623, 964, 1078, 1121, 1143, 1301, 1433, 1545, 1811, 1847, 1947, 1983, 2020, 2064, 2083, 2222, 2362], ('Tuesday', 'DRUG VIOLATION'): [125, 463, 2104], ('Tuesday', 'FAMILY OFFENSE'): [185, 229, 915, 1110, 1283, 1426, 2070, 2189, 2377, 2461], ...}

In [ ]:
# checkign how many groups we have

grouped.ngroups

7

In [ ]:
grouped.groups

{'Friday': [5, 14, 21, 26, 31, 36, 37, 41, 42, 78, 90, 95, 113, 114, 116, 130, 135, 137, 139, 140, 149, 152, 156, 159, 165, 166, 170, 173, 178, 192, 208, 222, 233, 236, 245, 249, 254, 268, 278, 281, 287, 303, 305, 331, 333, 335, 336, 341, 343, 346, 357, 375, 376, 377, 378, 382, 388, 396, 398, 402, 405, 418, 419, 422, 427, 431, 438, 441, 443, 452, 456, 467, 476, 485, 498, 508, 510, 511, 512, 513, 519, 523, 528, 532, 547, 549, 559, 571, 577, 578, 587, 596, 622, 631, 633, 637, 638, 639, 647, 656, ...], 'Monday': [4, 7, 13, 18, 19, 24, 35, 38, 40, 45, 56, 58, 62, 77, 79, 89, 91, 92, 99, 104, 108, 111, 127, 142, 150, 157, 175, 200, 213, 220, 235, 238, 242, 251, 253, 256, 257, 266, 290, 297, 307, 309, 310, 315, 316, 317, 319, 323, 329, 350, 361, 380, 387, 390, 399, 403, 414, 424, 428, 435, 437, 454, 460, 461, 473, 478, 482, 487, 489, 492, 494, 518, 520, 522, 525, 539, 557, 566, 599, 605, 616, 624, 630, 635, 641, 642, 650, 653, 661, 672, 683, 685, 713, 719, 720, 723, 724, 727, 731, 732, ...], 'Saturday': [6, 10, 22, 25, 39, 47, 49, 51, 59, 60, 63, 64, 66, 69, 72, 74, 83, 84, 87, 100, 118, 129, 132, 154, 160, 174, 177, 180, 190, 199, 204, 209, 212, 215, 216, 219, 227, 231, 241, 243, 263, 274, 283, 289, 292, 296, 304, 306, 322, 328, 334, 337, 342, 345, 353, 360, 363, 364, 366, 367, 369, 394, 395, 406, 412, 421, 423, 436, 439, 445, 453, 455, 458, 465, 481, 484, 493, 500, 502, 515, 530, 534, 540, 542, 545, 551, 556, 558, 562, 565, 567, 573, 576, 589, 594, 597, 598, 603, 607, 615, ...], 'Sunday': [0, 3, 8, 12, 23, 29, 33, 34, 48, 53, 61, 70, 81, 86, 94, 97, 103, 110, 112, 115, 124, 128, 141, 144, 151, 153, 161, 167, 168, 179, 183, 184, 186, 201, 202, 205, 211, 224, 230, 237, 246, 252, 262, 265, 269, 270, 273, 298, 300, 308, 321, 324, 327, 338, 354, 358, 371, 389, 397, 404, 408, 410, 417, 432, 434, 444, 471, 474, 475, 479, 488, 497, 501, 503, 507, 509, 514, 524, 526, 531, 543, 564, 575, 580, 586, 591, 593, 602, 604, 606, 608, 613, 614, 618, 636, 643, 649, 660, 671, 678, ...], 'Thursday': [2, 44, 50, 57, 67, 68, 73, 75, 80, 93, 101, 107, 119, 120, 126, 131, 162, 181, 196, 210, 214, 221, 228, 232, 239, 247, 255, 259, 264, 272, 285, 291, 293, 294, 320, 326, 355, 359, 365, 370, 379, 400, 401, 411, 413, 429, 442, 446, 448, 449, 457, 470, 483, 490, 504, 527, 535, 541, 546, 550, 552, 554, 555, 560, 569, 572, 579, 600, 601, 610, 611, 612, 619, 626, 627, 628, 632, 662, 673, 679, 680, 681, 686, 693, 700, 708, 710, 712, 740, 744, 745, 746, 749, 754, 758, 770, 772, 783, 788, 792, ...], 'Tuesday': [1, 9, 11, 17, 27, 28, 32, 43, 52, 54, 76, 82, 85, 88, 96, 98, 109, 117, 122, 123, 125, 133, 134, 136, 138, 143, 145, 146, 147, 148, 158, 164, 176, 182, 185, 187, 189, 194, 195, 197, 203, 206, 217, 223, 225, 229, 234, 240, 244, 267, 276, 280, 282, 286, 288, 295, 301, 302, 312, 318, 325, 330, 339, 347, 348, 349, 372, 373, 374, 381, 386, 393, 420, 425, 433, 447, 451, 459, 462, 463, 466, 486, 496, 505, 506, 516, 517, 521, 533, 536, 538, 548, 553, 561, 568, 570, 582, 590, 592, 609, ...], 'Wednesday': [15, 16, 20, 30, 46, 55, 65, 71, 102, 105, 106, 121, 155, 163, 169, 171, 172, 188, 191, 193, 198, 207, 218, 226, 248, 250, 258, 260, 261, 271, 275, 277, 279, 284, 299, 311, 313, 314, 332, 340, 344, 351, 352, 356, 362, 368, 383, 384, 385, 391, 392, 407, 409, 415, 416, 426, 430, 440, 450, 464, 468, 469, 472, 477, 480, 491, 495, 499, 529, 537, 544, 563, 574, 581, 583, 584, 585, 588, 595, 625, 634, 640, 644, 659, 669, 694, 701, 702, 704, 705, 721, 725, 730, 747, 752, 757, 767, 771, 777, 778, ...]}

In [ ]:
# printing the dataframe by day of the week with all the info


for key, value in grouped.groups.items():
  print("key:", key)
  print("values", df.iloc[value])

key: Friday
values         CASENO                   OFFENSE  ... df_date_only     DAY
5     20041090  THEFT MISD. (UNDER $950)  ...   09/04/2020  Friday
14    21090132            IDENTITY THEFT  ...   12/18/2020  Friday
21    20056610  THEFT MISD. (UNDER $950)  ...   12/11/2020  Friday
26    20053413                   ROBBERY  ...   11/20/2020  Friday
31    21003891  THEFT MISD. (UNDER $950)  ...   01/29/2021  Friday
...        ...                       ...  ...          ...     ...
2525  20056583                 VANDALISM  ...   12/11/2020  Friday
2532  20045649      BURGLARY RESIDENTIAL  ...   10/02/2020  Friday
2534  20050224               DISTURBANCE  ...   10/30/2020  Friday
2535  21006096               BRANDISHING  ...   02/12/2021  Friday
2536  20044389  THEFT FELONY (OVER $950)  ...   09/25/2020  Friday

[388 rows x 13 columns]
key: Monday
values         CASENO                   OFFENSE  ... df_date_only     DAY
4     20050711     ASSAULT/BATTERY MISD.  ...   11/02/2020  Monday
7     20054742            VEHICLE STOLEN  ...   11/23/2020  Monday
13    20048374  THEFT MISD. (UNDER $950)  ...   10/19/2020  Monday
18    20055766  THEFT MISD. (UNDER $950)  ...   12/07/2020  Monday
19    20046093     ASSAULT/BATTERY MISD.  ...   10/05/2020  Monday
...        ...                       ...  ...          ...     ...
2519  20052718  THEFT MISD. (UNDER $950)  ...   11/16/2020  Monday
2526  21005589               DISTURBANCE  ...   02/08/2021  Monday
2531  20047226                 VANDALISM  ...   10/12/2020  Monday
2533  21000423  THEFT MISD. (UNDER $950)  ...   01/04/2021  Monday
2537  20051685               DISTURBANCE  ...   11/09/2020  Monday

[366 rows x 13 columns]
key: Saturday
values         CASENO                   OFFENSE  ... df_date_only       DAY
6     21005629               DISTURBANCE  ...   01/16/2021  Saturday
10    20057613  THEFT MISD. (UNDER $950)  ...   12/19/2020  Saturday
22    20041431            VEHICLE STOLEN  ...   09/05/2020  Saturday
25    21003140            VEHICLE STOLEN  ...   01/23/2021  Saturday
39    21002012  THEFT MISD. (UNDER $950)  ...   01/16/2021  Saturday
...        ...                       ...  ...          ...       ...
2505  21007370  THEFT MISD. (UNDER $950)  ...   02/20/2021  Saturday
2506  20048076         DOMESTIC VIOLENCE  ...   10/17/2020  Saturday
2514  21090144  THEFT MISD. (UNDER $950)  ...   01/30/2021  Saturday
2521  21003074            VEHICLE STOLEN  ...   01/23/2021  Saturday
2530  20041317  THEFT MISD. (UNDER $950)  ...   09/05/2020  Saturday

[390 rows x 13 columns]
key: Sunday
values         CASENO                   OFFENSE  ... df_date_only     DAY
0     20047075            VEHICLE STOLEN  ...   10/11/2020  Sunday
3     20045958  THEFT FELONY (OVER $950)  ...   10/04/2020  Sunday
8     20056763  THEFT FELONY (OVER $950)  ...   12/13/2020  Sunday
12    21004226  THEFT MISD. (UNDER $950)  ...   01/31/2021  Sunday
23    20092155             BURGLARY AUTO  ...   11/29/2020  Sunday
...        ...                       ...  ...          ...     ...
2472  20044742  THEFT MISD. (UNDER $950)  ...   09/27/2020  Sunday
2500  20045981  THEFT MISD. (UNDER $950)  ...   10/04/2020  Sunday
2513  21005320     ASSAULT/BATTERY MISD.  ...   02/07/2021  Sunday
2523  21090063  THEFT FELONY (OVER $950)  ...   01/10/2021  Sunday
2540  20050504       BURGLARY COMMERCIAL  ...   11/01/2020  Sunday

[344 rows x 13 columns]
key: Thursday
values         CASENO                   OFFENSE  ... df_date_only       DAY
2     21090137  THEFT FELONY (OVER $950)  ...   01/28/2021  Thursday
44    20058337      BURGLARY RESIDENTIAL  ...   12/24/2020  Thursday
50    20050090                GUN/WEAPON  ...   10/29/2020  Thursday
57    21003752  THEFT MISD. (UNDER $950)  ...   01/28/2021  Thursday
67    20051176               DISTURBANCE  ...   11/05/2020  Thursday
...        ...                       ...  ...          ...       ...
2524  20044142      BURGLARY RESIDENTIAL  ...   09/24/2020  Thursday
2527  20043041         DOMESTIC VIOLENCE  ...   09/17/2020  Thursday
2528  20091737             BURGLARY AUTO  ...   09/10/2020  Thursday
2529  20052264             BURGLARY AUTO  ...   11/12/2020  Thursday
2538  20055176  THEFT MISD. (UNDER $950)  ...   12/03/2020  Thursday

[351 rows x 13 columns]
key: Tuesday
values         CASENO                   OFFENSE  ... df_date_only      DAY
1     20049646            IDENTITY THEFT  ...   09/29/2020  Tuesday
9     20051823  THEFT MISD. (UNDER $950)  ...   11/10/2020  Tuesday
11    20058005  THEFT FELONY (OVER $950)  ...   10/27/2020  Tuesday
17    21090073                 VANDALISM  ...   01/12/2021  Tuesday
27    20052927             MISSING ADULT  ...   09/15/2020  Tuesday
...        ...                       ...  ...          ...      ...
2495  20042632  THEFT MISD. (UNDER $950)  ...   09/15/2020  Tuesday
2496  21090040  THEFT MISD. (UNDER $950)  ...   01/05/2021  Tuesday
2502  21090208  THEFT FELONY (OVER $950)  ...   02/16/2021  Tuesday
2518  21005929            VEHICLE STOLEN  ...   02/09/2021  Tuesday
2539  21003589  THEFT FELONY (OVER $950)  ...   01/26/2021  Tuesday

[353 rows x 13 columns]
key: Wednesday
values         CASENO                   OFFENSE  ... df_date_only        DAY
15    20055065             MISSING ADULT  ...   11/11/2020  Wednesday
16    20058927       BURGLARY COMMERCIAL  ...   12/23/2020  Wednesday
20    20049935  THEFT MISD. (UNDER $950)  ...   10/21/2020  Wednesday
30    20047634            VEHICLE STOLEN  ...   10/07/2020  Wednesday
46    20049809                 NARCOTICS  ...   10/28/2020  Wednesday
...        ...                       ...  ...          ...        ...
2483  21000641               DISTURBANCE  ...   01/06/2021  Wednesday
2501  21003922  THEFT FELONY (OVER $950)  ...   01/20/2021  Wednesday
2508  20055105  THEFT MISD. (UNDER $950)  ...   12/02/2020  Wednesday
2509  20046317      BURGLARY RESIDENTIAL  ...   10/07/2020  Wednesday
2512  20047470             FRAUD/FORGERY  ...   10/07/2020  Wednesday

[349 rows x 13 columns]

In [ ]:
# Last week we created offense_df. This was a subset of CVLEGEND and OFFENSE columns. 
# There are 28 OFFENSE types and 21 CVLEGEND types. 
# How many offenses of each kind are listed per CVLEGEND type?

# subset the part of the df to look at 2 columns
# and then group this subset by these 2 columns
# we need to do it in 2 steps

off_df=df[ ['CVLEGEND', 'OFFENSE'] ]
off_df.groupby(['CVLEGEND', 'OFFENSE']).count()

Empty DataFrame
Columns: []
Index: [(ALL OTHER OFFENSES, MUNICIPAL CODE), (ARSON, ARSON), (ASSAULT, ASSAULT/BATTERY FEL.), (ASSAULT, ASSAULT/BATTERY MISD.), (BURGLARY - COMMERCIAL, BURGLARY COMMERCIAL), (BURGLARY - RESIDENTIAL, BURGLARY RESIDENTIAL), (BURGLARY - VEHICLE, BURGLARY AUTO), (DISORDERLY CONDUCT, DISTURBANCE), (DRUG VIOLATION, NARCOTICS), (FAMILY OFFENSE, DOMESTIC VIOLENCE), (FRAUD, FRAUD/FORGERY), (FRAUD, IDENTITY THEFT), (HOMICIDE, HOMICIDE), (LARCENY, THEFT FELONY (OVER $950)), (LARCENY, THEFT FROM PERSON), (LARCENY, THEFT MISD. (UNDER $950)), (LARCENY - FROM VEHICLE, THEFT FROM AUTO), (LIQUOR LAW VIOLATION, ALCOHOL OFFENSE), (MISSING PERSON, MISSING ADULT), (MISSING PERSON, MISSING JUVENILE), (MOTOR VEHICLE THEFT, VEHICLE STOLEN), (RECOVERED VEHICLE, VEHICLE RECOVERED), (ROBBERY, ROBBERY), (SEX CRIME, SEXUAL ASSAULT FEL.), (SEX CRIME, SEXUAL ASSAULT MISD.), (VANDALISM, VANDALISM), (WEAPONS OFFENSE, BRANDISHING), (WEAPONS OFFENSE, GUN/WEAPON)]

# Exploring Berkeley dataset with subsetting

In [ ]:
# Question: We see the 4 most common offenses and 4 most common places where crimes occur in Berkeley,
# Which of these 4 offenses have occurred regularly in the same places?

# slicing the dataset by these 4 most common offenses
df_larceny = df[df["CVLEGEND"]=='LARCENY']
df_vehicle_theft = df[df["CVLEGEND"]=='MOTOR VEHICLE THEFT']
df_dis_conduct = df[df["CVLEGEND"]=='DISORDERLY CONDUCT']
df_assault = df[df["CVLEGEND"]=='ASSAULT']

# printing length of each subset

len(df_larceny), len(df_vehicle_theft), len(df_dis_conduct), len(df_assault)

(819, 212, 182, 137)

In [ ]:
## seems interesting
# places (blocks) where most incedents occur

pd.Series.unique(df['BLKADDR'])
df['BLKADDR'].value_counts()

2800 BLOCK ADELINE ST        100
2100 BLOCK SHATTUCK AVE       71
1000 BLOCK GILMAN ST          56
2600 BLOCK TELEGRAPH AVE      48
1400 BLOCK UNIVERSITY AVE     44
                            ...
550 COLUSA AVE                 1
600 BLOCK HEARST AVE           1
2200 BLOCK RUSSELL ST          1
2900 BLOCK NEWBURY ST          1
800 BLOCK ARLINGTON AVE        1
Name: BLKADDR, Length: 820, dtype: int64

In [ ]:
# let's sxplore all 4 main offenses by most common places of occurrence

# offense 1: Larceny

print('Larceny at 2800 BLOCK ADELINE ST:', sum(df_larceny["BLKADDR"] == '2800 BLOCK ADELINE ST'))
print('Larceny at 2100 BLOCK SHATTUCK AVE:', sum(df_larceny["BLKADDR"] == '2100 BLOCK SHATTUCK AVE'))
print('Larceny at 2600 BLOCK TELEGRAPH AVE:', sum(df_larceny["BLKADDR"] == '2600 BLOCK TELEGRAPH AVE'))
print('Larceny at 1000 BLOCK GILMAN ST:', sum(df_larceny["BLKADDR"] == '1000 BLOCK GILMAN ST'))

Larceny at 2800 BLOCK ADELINE ST: 84
Larceny at 2100 BLOCK SHATTUCK AVE: 37
Larceny at 2600 BLOCK TELEGRAPH AVE: 27
Larceny at 1000 BLOCK GILMAN ST: 43

In [ ]:
# offense 2: vehicle_theft

print('Vehicle theft at 2800 BLOCK ADELINE ST:', sum(df_vehicle_theft["BLKADDR"] == '2800 BLOCK ADELINE ST'))
print('Vehicle theft at 2100 BLOCK SHATTUCK AVE:', sum(df_vehicle_theft["BLKADDR"] == '2100 BLOCK SHATTUCK AVE'))
print('Vehicle theft at 2600 BLOCK TELEGRAPH AVE:', sum(df_vehicle_theft["BLKADDR"] == '2600 BLOCK TELEGRAPH AVE'))
print('Vehicle theft at 1000 BLOCK GILMAN ST:', sum(df_vehicle_theft["BLKADDR"] == '1000 BLOCK GILMAN ST'))

Vehicle theft at 2800 BLOCK ADELINE ST: 0
Vehicle theft at 2100 BLOCK SHATTUCK AVE: 1
Vehicle theft at 2600 BLOCK TELEGRAPH AVE: 0
Vehicle theft at 1000 BLOCK GILMAN ST: 3

In [ ]:
# I wanted to check if it was right that there was no vehicle theft at most common offense locations

df_vehicle_theft['BLKADDR'].value_counts()

1100 BLOCK UNIVERSITY AVE     5
200 BLOCK MARINA BLVD         4
600 BLOCK GILMAN ST           3
1000 BLOCK GILMAN ST          3
1800 BLOCK SAN LORENZO AVE    3
                             ..
1900 BLOCK HARMON ST          1
1500 BLOCK HENRY ST           1
1400 BLOCK PERALTA AVE        1
900 BLOCK SAN BENITO RD       1
1400 BLOCK 6TH ST             1
Name: BLKADDR, Length: 177, dtype: int64

In [ ]:
# offense 3: DISORDERLY CONDUCT

print('DISORDERLY CONDUCT  at 2800 BLOCK ADELINE ST:', sum(df_dis_conduct["BLKADDR"] == '2800 BLOCK ADELINE ST'))
print('DISORDERLY CONDUCT  at 2100 BLOCK SHATTUCK AVE:', sum(df_dis_conduct["BLKADDR"] == '2100 BLOCK SHATTUCK AVE'))
print('DISORDERLY CONDUCT  at 2600 BLOCK TELEGRAPH AVE:', sum(df_dis_conduct["BLKADDR"] == '2600 BLOCK TELEGRAPH AVE'))
print('DISORDERLY CONDUCT  at 1000 BLOCK GILMAN ST:', sum(df_dis_conduct["BLKADDR"] == '1000 BLOCK GILMAN ST'))

DISORDERLY CONDUCT  at 2800 BLOCK ADELINE ST: 1
DISORDERLY CONDUCT  at 2100 BLOCK SHATTUCK AVE: 5
DISORDERLY CONDUCT  at 2600 BLOCK TELEGRAPH AVE: 2
DISORDERLY CONDUCT  at 1000 BLOCK GILMAN ST: 1

In [ ]:
# I wanted to check if it was right that there was no disorderly conduct at most common offense locations

df_dis_conduct['BLKADDR'].value_counts()

2100 BLOCK SHATTUCK AVE      5
1700 BLOCK HOPKINS ST        4
1900 BLOCK SAN PABLO AVE     4
2500 BLOCK TELEGRAPH AVE     3
1800 BLOCK UNIVERSITY AVE    3
                            ..
2500 BLOCK DURANT AVE        1
2600 BLOCK DWIGHT WAY        1
800 BLOCK UNIVERSITY AVE     1
2100 BLOCK DWIGHT WAY        1
2800 BLOCK FULTON ST         1
Name: BLKADDR, Length: 140, dtype: int64

In [ ]:
# offense 4: Assault

print('Assault at 2800 BLOCK ADELINE ST:', sum(df_assault["BLKADDR"] == '2800 BLOCK ADELINE ST'))
print('Assault at 2100 BLOCK SHATTUCK AVE:', sum(df_assault["BLKADDR"] == '2100 BLOCK SHATTUCK AVE'))
print('Assault at 2600 BLOCK TELEGRAPH AVE:', sum(df_assault["BLKADDR"] == '2600 BLOCK TELEGRAPH AVE'))
print('Assault at 1000 BLOCK GILMAN ST:', sum(df_assault["BLKADDR"] == '1000 BLOCK GILMAN ST'))

Assault at 2800 BLOCK ADELINE ST: 1
Assault at 2100 BLOCK SHATTUCK AVE: 8
Assault at 2600 BLOCK TELEGRAPH AVE: 2
Assault at 1000 BLOCK GILMAN ST: 2

In [ ]:
# I wanted to check if it was right that there was no assult at most common offense locations

df_assault['BLKADDR'].value_counts()

2100 BLOCK SHATTUCK AVE      8
2300 BLOCK TELEGRAPH AVE     6
2400 BLOCK ASHBY AVE         4
2300 BLOCK SHATTUCK AVE      4
2500 BLOCK TELEGRAPH AVE     3
                            ..
900 BLOCK ASHBY AVE          1
1800 BLOCK 6TH ST            1
1100 BLOCK UNIVERSITY AVE    1
1800 BLOCK SAN PABLO AVE     1
1006 VIRGINIA ST             1
Name: BLKADDR, Length: 96, dtype: int64

In [ ]:
# subsetting columns offense and cvlegend to compare

off_df=df[['OFFENSE', 'CVLEGEND']]
off_df

                       OFFENSE               CVLEGEND
0               VEHICLE STOLEN    MOTOR VEHICLE THEFT
1               IDENTITY THEFT                  FRAUD
2     THEFT FELONY (OVER $950)                LARCENY
3     THEFT FELONY (OVER $950)                LARCENY
4        ASSAULT/BATTERY MISD.                ASSAULT
...                        ...                    ...
2536  THEFT FELONY (OVER $950)                LARCENY
2537               DISTURBANCE     DISORDERLY CONDUCT
2538  THEFT MISD. (UNDER $950)                LARCENY
2539  THEFT FELONY (OVER $950)                LARCENY
2540       BURGLARY COMMERCIAL  BURGLARY - COMMERCIAL

[2541 rows x 2 columns]

In [ ]:
# checking duplicates in boolean
off_df['CVLEGEND'].duplicated()

0       False
1       False
2       False
3        True
4       False
        ...
2536     True
2537     True
2538     True
2539     True
2540     True
Name: CVLEGEND, Length: 2541, dtype: bool

In [ ]:
len(off_df)

2541

In [ ]:
# to delete duplicates

off_df.drop_duplicates()

                      OFFENSE                CVLEGEND
0              VEHICLE STOLEN     MOTOR VEHICLE THEFT
1              IDENTITY THEFT                   FRAUD
2    THEFT FELONY (OVER $950)                 LARCENY
4       ASSAULT/BATTERY MISD.                 ASSAULT
5    THEFT MISD. (UNDER $950)                 LARCENY
6                 DISTURBANCE      DISORDERLY CONDUCT
15              MISSING ADULT          MISSING PERSON
16        BURGLARY COMMERCIAL   BURGLARY - COMMERCIAL
17                  VANDALISM               VANDALISM
23              BURGLARY AUTO      BURGLARY - VEHICLE
26                    ROBBERY                 ROBBERY
37            THEFT FROM AUTO  LARCENY - FROM VEHICLE
44       BURGLARY RESIDENTIAL  BURGLARY - RESIDENTIAL
46                  NARCOTICS          DRUG VIOLATION
50                 GUN/WEAPON         WEAPONS OFFENSE
64          DOMESTIC VIOLENCE          FAMILY OFFENSE
79                BRANDISHING         WEAPONS OFFENSE
84                      ARSON                   ARSON
87       ASSAULT/BATTERY FEL.                 ASSAULT
95        SEXUAL ASSAULT FEL.               SEX CRIME
103         THEFT FROM PERSON                 LARCENY
160           ALCOHOL OFFENSE    LIQUOR LAW VIOLATION
200             FRAUD/FORGERY                   FRAUD
221         VEHICLE RECOVERED       RECOVERED VEHICLE
269      SEXUAL ASSAULT MISD.               SEX CRIME
498            MUNICIPAL CODE      ALL OTHER OFFENSES
753          MISSING JUVENILE          MISSING PERSON
802                  HOMICIDE                HOMICIDE

In [ ]:
# the lenght of drop_duplicates

len(off_df.drop_duplicates())

28

In [ ]:
# to count the repetitive cases

off_df.groupby('CVLEGEND').count()

                        OFFENSE
CVLEGEND
ALL OTHER OFFENSES            2
ARSON                        20
ASSAULT                     137
BURGLARY - COMMERCIAL        97
BURGLARY - RESIDENTIAL      180
BURGLARY - VEHICLE          159
DISORDERLY CONDUCT          182
DRUG VIOLATION               28
FAMILY OFFENSE               87
FRAUD                       116
HOMICIDE                      2
LARCENY                     819
LARCENY - FROM VEHICLE      144
LIQUOR LAW VIOLATION         22
MISSING PERSON               31
MOTOR VEHICLE THEFT         212
RECOVERED VEHICLE             3
ROBBERY                      91
SEX CRIME                    21
VANDALISM                   156
WEAPONS OFFENSE              32

In [ ]:
# create offence map to delete duplicates

offense_map={"BURGLARY - COMMERCIAL" : "BURGLARY", "BURGLARY - RESIDENTIAL" : "BURGLARY", "BURGLARY - VEHICLE" : "BURGLARY", "LARCENY - FROM VEHICLE": "LARCENY" }
offense_map

{'BURGLARY - COMMERCIAL': 'BURGLARY',
 'BURGLARY - RESIDENTIAL': 'BURGLARY',
 'BURGLARY - VEHICLE': 'BURGLARY',
 'LARCENY - FROM VEHICLE': 'LARCENY'}

In [ ]:
off_df.CVLEGEND.map(offense_map)

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
          ...
2536         NaN
2537         NaN
2538         NaN
2539         NaN
2540    BURGLARY
Name: CVLEGEND, Length: 2541, dtype: object

In [ ]:
df[~df['CVLEGEND'].duplicated()]

       CASENO                   OFFENSE  ... df_date_only        DAY
0    20047075            VEHICLE STOLEN  ...   10/11/2020     Sunday
1    20049646            IDENTITY THEFT  ...   09/29/2020    Tuesday
2    21090137  THEFT FELONY (OVER $950)  ...   01/28/2021   Thursday
4    20050711     ASSAULT/BATTERY MISD.  ...   11/02/2020     Monday
6    21005629               DISTURBANCE  ...   01/16/2021   Saturday
15   20055065             MISSING ADULT  ...   11/11/2020  Wednesday
16   20058927       BURGLARY COMMERCIAL  ...   12/23/2020  Wednesday
17   21090073                 VANDALISM  ...   01/12/2021    Tuesday
23   20092155             BURGLARY AUTO  ...   11/29/2020     Sunday
26   20053413                   ROBBERY  ...   11/20/2020     Friday
37   21001374           THEFT FROM AUTO  ...   01/01/2021     Friday
44   20058337      BURGLARY RESIDENTIAL  ...   12/24/2020   Thursday
46   20049809                 NARCOTICS  ...   10/28/2020  Wednesday
50   20050090                GUN/WEAPON  ...   10/29/2020   Thursday
64   21005172         DOMESTIC VIOLENCE  ...   02/06/2021   Saturday
84   21007390                     ARSON  ...   02/20/2021   Saturday
95   21000165       SEXUAL ASSAULT FEL.  ...   01/01/2021     Friday
160  21004102           ALCOHOL OFFENSE  ...   01/30/2021   Saturday
221  20059222         VEHICLE RECOVERED  ...   12/31/2020   Thursday
498  20045634            MUNICIPAL CODE  ...   10/02/2020     Friday
802  20044589                  HOMICIDE  ...   09/26/2020   Saturday

[21 rows x 13 columns]

# String operations

In [ ]:
s = "This is a very long sentence that we will break up. This one has a    lot   of  spaces  .    "
s

'This is a very long sentence that we will break up. This one has a    lot   of  spaces  .    '

In [ ]:
# split() will split with the `space` character.
s.split()

['This',
 'is',
 'a',
 'very',
 'long',
 'sentence',
 'that',
 'we',
 'will',
 'break',
 'up.',
 'This',
 'one',
 'has',
 'a',
 'lot',
 'of',
 'spaces',
 '.']

In [ ]:
# You can split with any character.
s.split(".")

['This is a very long sentence that we will break up',
 ' This one has a    lot   of  spaces  ',
 '    ']

In [ ]:
# notice that the character used to split is not in the result.
s.split("a")

['This is ',
 ' very long sentence th',
 't we will bre',
 'k up. This one h',
 's ',
 '    lot   of  sp',
 'ces  .    ']

# String split in pandas

In [ ]:
# notice that the character used to split is not in the result.
p = pd.Series(["Three word sentence",
               "Another such sentence",
               "Third sentence too"])

p

0      Three word sentence
1    Another such sentence
2       Third sentence too
dtype: object

In [ ]:
p.str.split()

0      [Three, word, sentence]
1    [Another, such, sentence]
2       [Third, sentence, too]
dtype: object

In [ ]:
split_p = p.str.split()
print(type(split_p))

<class 'pandas.core.series.Series'>

In [ ]:
# subset 2nd row

split_p[1]

['Another', 'such', 'sentence']

In [ ]:
# subset last column

split_p.str[-1]

0    sentence
1    sentence
2         too
dtype: object

In [ ]:
split_p.str.get(-1)

0    sentence
1    sentence
2         too
dtype: object

# Join strings

In [ ]:
".".join(['a', 'b', 'c'])

'a.b.c'

In [ ]:
"  ".join(['a', 'b', 'c'])

'a  b  c'

# RegEx

In [ ]:
r = '2100 SHATTUCK AVE\nBerkeley, CA\n(37.871167, -122.268285)'

In [ ]:
r.split()

['2100', 'SHATTUCK', 'AVE', 'Berkeley,', 'CA', '(37.871167,', '-122.268285)']

Pictorial representation: https://www.python-course.eu/re.php

In [ ]:
import re

In [ ]:
a = re.split(r'[()]', r)
a[0]

'2100 SHATTUCK AVE\nBerkeley, CA\n'

In [ ]:
a[1]

'37.871167, -122.268285'

In [ ]:
# find items in the string

txt = "I have a pet in petaluma"
x = re.findall("pet", txt)
print(x)

['pet', 'pet']

In [ ]:
# search

ex = "There is a Spade near the sand"
t=re.search("\s", ex)
print(t)

<re.Match object; span=(5, 6), match=' '>

In [ ]:
ex1 = "There is a Spade near the sand"
x = re.search("near",ex1)
print(x)

<re.Match object; span=(17, 21), match='near'>

In [ ]:
# re.sub

# Every match of the regular expression regex in the string subject will be replaced by the string replacement.

import re

ex2 = "The rain in Spain"
x1 = re.sub("\s", "9", ex2,2)
print(x1)

The9rain9in Spain